package HomeWork_4;

import java.util.Scanner;

public class Lesson2SinX {

    public static void main(String[] args) {

//  Написать программу, которая печатает значение sin (x), где Х это 10 градусов от 0 до 360

        int degrees = 360;

        for ( int i = 0; i <= degrees; i = i + 10) {

            System.out.println("sin x = " + i);

        }





        }

    }


