package CyclesYouTubeHomeWork;

import java.util.Scanner;

public class Lesson5 {
    public static void main(String[] args) {
        //Найти произведение чисел от m до n (m и n вводятся с клавиатуры).
        // При этом сделать проверку: n,m  в пределах от -256 до 256

        System.out.println("Введите число M");
        int m = new Scanner(System.in).nextInt();
        System.out.println("Ведите число N");
        int n = new Scanner(System.in).nextInt();


        }



}
